Revit 2027 API
ValueParsingOptions.AllowedValues Property
 The allowable range of values to be parsed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AllowedValues AllowedValues { get; set; }
Public Property AllowedValues As AllowedValues
	Get
	Set
public:
property AllowedValues AllowedValues {
	AllowedValues get ();
	void set (AllowedValues value);
}
member AllowedValues : AllowedValues with get, set
Property Value
AllowedValues
 The allowable range of values. The default is All.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ValueParsingOptions Class
Autodesk.Revit.DB Namespace